﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿/=#
#include "VFR.uni"

//---------------------------------------------------------------------------
// Digital IO Port Configuration
//---------------------------------------------------------------------------
#string STR_DIO_FORM			#language eng "Digital IO Port Configuration"
#string STR_DIO_FORM_HELP		#language eng "Set Input/Output of Digital IO Port Configuration"

#string STR_AAEON_DIO_CALLBACK	#language eng "Item for a setup callback"
#string STR_AAEON_DIO_DUMMY		#language eng "N/A"

#string STR_DIO0_PROMPT			#language eng "DIO1"
#string STR_DIO1_PROMPT			#language eng "DIO2"
#string STR_DIO2_PROMPT			#language eng "DIO3"
#string STR_DIO3_PROMPT			#language eng "DIO4"
#string STR_DIO4_PROMPT			#language eng "DIO5"
#string STR_DIO5_PROMPT			#language eng "DIO6"
#string STR_DIO6_PROMPT			#language eng "DIO7"
#string STR_DIO7_PROMPT			#language eng "DIO8"
#string STR_DIO8_PROMPT			#language eng "DIO9"
#string STR_DIO9_PROMPT			#language eng "DIO10"
#string STR_DIO10_PROMPT		#language eng "DIO11"
#string STR_DIO11_PROMPT		#language eng "DIO12"
#string STR_DIO12_PROMPT		#language eng "DIO13"
#string STR_DIO13_PROMPT		#language eng "DIO14"
#string STR_DIO14_PROMPT		#language eng "DIO15"
#string STR_DIO15_PROMPT		#language eng "DIO16"
#string STR_DIO_DIR_HELP		#language eng "Set DIO as Input or Output"

#string STR_DIR_IN          		#language eng "Input "
#string STR_DIR_OUT		        #language eng "Output"

#string STR_DIO_LV_PROMPT		#language eng "  Output Level"
#string STR_DIO_LV_HELP	        	#language eng "Set output level when DIO pin is output"
#string STR_DIO_HI      		#language eng "High"
#string STR_DIO_LOW	        	#language eng "Low"

#string STR_DIO_DRIVING_PROMPT		#language eng "  Driving"
#string STR_DIO_DRIVING_HELP		#language eng "Set DIO driving mode"
#string STR_DIO_OPEN_DRAIN		#language eng "Open-drain"
#string STR_DIO_PUSH_PULL		#language eng "Push-pull"
#string STR_DIO_PULL_20K		#language eng "Pull-up 20K"
#string STR_DIO_PULL_10K		#language eng "Pull-up 10K"
#string STR_DIO_PULL_5K			#language eng "Pull-up 5K"
#string STR_DIO_PULL_1K			#language eng "Pull-up 1K"

#string STR_DIO_INTERRUPT_PROMPT	#language eng "  Interrupt"
#string STR_DIO_INTERRUPT_HELP		#language eng "Set DIO to generate interrupt. Low triggering."

#string STR_DIO_SOURCE_FORM		#language eng "DIO Controller Configuration"
#string STR_DIO_SOURCE_FORM_HELP	#language eng "DIO Controller Configuration"

#string STR_AAEON_DIO_SOURCE		#language eng "1st DIO Source"
#string STR_AAEON_SEC_DIO_SOURCE	#language eng "2nd DIO Source"
#string STR_AAEON_DIO_SOURCE_HELP	#language eng "Select DIO Source."

#string STR_AAEON_DIO_GPIO		#language eng "  GPIO Number"
#string STR_AAEON_DIO_GPIO_HELP		#language eng "Set GPIO Number on source."

#string STR_SEC_DIO			#language eng "Secondary DIO"
